docs/data_model.md
```mermaid
erDiagram
  FLOWPATHS {
    string    flowpath_id
    string    flowpath_toid
    text   vpuid
    string    poi_id
    int    mainstem_id
    float  areasqkm
    float  lengthkm
    float  total_dasqkm
    int    hydroseq
    int    streamorder
    float  slope
  }

  DIVIDES {
    string    divide_id
    string    flowpath_id
    text   vpuid
    float  areasqkm
    text   type
  }

  POIS {
    string    poi_id
    string    flowpath_id
    text   hl_classes
    text   hl_types
    int    hl_count
    text vpuid
  }

  HYDROLOCATIONS {
    string    poi_id
    string    flowpath_id
    text   vpuid
    text   hl_type
    text   hl_link
    text   hl_class
    text   hl_reference
    text   hl_uri
  }

  NETWORK {
    string    flowpath_id
    string    flowpath_toid
    int    mainstem_id
    int    hydroseq
    float  areasqkm
    float  lengthkm
    float  total_dasqkm
    text   vpuid
    string    divide_id
    string    poi_id
    text   hl_reference
    string   hf_id
    string   hf_toid
    text   hf_source
    int    hf_hydroseq
    string    flowline_id
    string    flowline_toid
    string    incremental_area_id
    float  flowline_areasqkm
    int    flowline_hydroseq
    float  flowline_lengthkm
    float  flowline_total_dasqkm
  }

  FLOWLINES {
    string    flowline_id
    string    flowline_toid
    string    flowpath_id
    text   vpuid
    int    mainstem_id
    int    flowline_hydroseq
    int    flowpath_hydroseq
    string    incremental_area_id
    float  incremental_areasqkm
    float  lengthkm
    float  total_dasqkm
    int    streamorder
    float  slope
  }

  INCREMENTAL_AREA {
    string    incremental_area_id
    float  incremental_proportion
    string    flowline_id
    text   vpuid
    float  areasqkm
    text   type
  }

  NEXUS {
    string  nexus_id
    string  nexus_toid
    text vpuid
  }

  %% Relationships
  FLOWPATHS ||--o{ DIVIDES : owns
  FLOWPATHS ||--o{ POIS : hosts
  POIS ||--o{ HYDROLOCATIONS : aggregates
  FLOWPATHS ||--o{ HYDROLOCATIONS : snapped_to
  
  FLOWPATHS ||--|| NETWORK : "canonical view"
  DIVIDES   ||--o{ NETWORK : referenced_by
  POIS      ||--o{ NETWORK : optional_poi
  
  FLOWPATHS ||--o{ FLOWLINES : aggregates
  FLOWLINES ||--|| INCREMENTAL_AREA : has
  
  NEXUS ||--o{ FLOWPATHS : pins
  NEXUS ||--o{ FLOWLINES : pins
```
